VatEngine/src/test/resources/BH_test19_VatRates.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?>
<iVATEngineInput>
<IncludeReportingIndicationInResponse>True</IncludeReportingIndicationInResponse>
	<Supplier>
		<ID>112256</ID>
		<Name>BHCOMPANY1</Name>
		<Address/>
		<ZIP/>
		<City/>
		<Country>BH</Country>
		<RegOfCommerce/>
		<BancAccountNumber/>
		<IBAN/>
		<BIC/>
		<TelephoneNumber/>
		<FaxNumber/>
		<EmailAddress/>
		<SpecialType>0</SpecialType>
		<DeductionType>0</DeductionType>
		<VATNumberSupplier Country="BH">
			<VATNumber>BH5555567342</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<TaxNumber/>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberSupplier>
		<CountryChosenVATNumber>BH</CountryChosenVATNumber>
	</Supplier>
	<Customer>
		<ID>21535</ID>
		<Name>BECOMPANY NV</Name>
		<Address>TOEKOMSTSTRAAT 10</Address>
		<ZIP>2000</ZIP>
		<City>ANTWERPEN</City>
		<EmailAddress/>
		<Country>BE</Country>
		<SpecialType>0</SpecialType>
		<VATNumberCustomer Country="BE">
			<VATNumber>BE0686731303</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<RequiredOnInvoicePicture>false</RequiredOnInvoicePicture>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberCustomer>
		<CountryChosenVATNumber>BE</CountryChosenVATNumber>
	</Customer>
	<InvoiceProperties>
		<DocumentType>0</DocumentType>
		<Disconto>0</Disconto>
		<Currency1>EUR</Currency1>
		<InvoiceNumber/>
		<ReferenceInvoiceNumber/>
		<InvoiceDate>2019-01-23</InvoiceDate>
		<OfficialLanguage>3</OfficialLanguage>
	</InvoiceProperties>
	<Item ID="1">
		<Properties>
			<Description/>
			<InternationalDescription LanguageID="1">roerende goederen / geen installatie (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="2">biens mobiliers / pas d&#180;installation (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="3">Movable tangible property / No installation (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="5">Mobilien / Keine Installation (-100 -) </InternationalDescription>
			<TaricCode/>
			<Amounts CurrencyNumber="1">
				<UnitPriceExclVAT>100</UnitPriceExclVAT>
				<TotalAmountExclVAT>100</TotalAmountExclVAT>
				<PackagingCosts>0</PackagingCosts>
			</Amounts>
			<Number>1</Number>
			<Unit/>
			<VATRate>0</VATRate>
			<Reduction>0</Reduction>
			<AdditionalProperties>
				<PropertiesPerCountry Country="BH">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<PropertiesPerCountry Country="BE">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<EngineParameter1>AAAA</EngineParameter1>
				<EngineParameter2/>
				<EngineParameter3/>
			</AdditionalProperties>
			<ItemClassificationCode>100</ItemClassificationCode>
			<OutOfVAT>0</OutOfVAT>
			<ReportingProperties>
				<CommodityCode/>
			</ReportingProperties>
		</Properties>
		<Conditions>
			<ShipFrom>
				<CountryDeparture>BH</CountryDeparture>
			</ShipFrom>
			<ShipTo>
				<CountryArrival>BE</CountryArrival>
			</ShipTo>
			<Installation>0</Installation>
			<Transporter>1</Transporter>
			<Importer>1</Importer>
			<DateTransaction>2019-01-23</DateTransaction>
		</Conditions>
		<AdditionalMentioning>
			<Text>The goods are not installed. / De goederen worden niet geïnstalleerd.</Text>
		</AdditionalMentioning>
		<AdditionalMentioning>
			<Text>The buyer transports from Bahrain to Belgium. / Koper vervoert van Bahrein naar België.</Text>
		</AdditionalMentioning>
	</Item>
	<AmountsSummary CurrencyNumber="1">
		<VATTotals VATRate="0">
			<AmountDisconto>0</AmountDisconto>
			<AmountExclVAT>100</AmountExclVAT>
			<AmountVAT>0</AmountVAT>
		</VATTotals>
		<Totals>
			<TotalAmountVAT>0</TotalAmountVAT>
			<TotalAmountInclVAT>100</TotalAmountInclVAT>
			<TotalAmountDisconto>0</TotalAmountDisconto>
			<TotalAmountInclVATCash>100</TotalAmountInclVATCash>
			<TotalAmountPackagingCosts>0</TotalAmountPackagingCosts>
		</Totals>
	</AmountsSummary>
	<CheckValue>100</CheckValue>
</iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>